# リスト内包表記
t = (1, 2, 3, 4, 5)
# 通常のリストの作り方
r = []
for i in t:
    r.append(i)
print(r) # [1, 2, 3, 4, 5]
# ワンライナーで書ける
r = [i for i in t]
print(r) # [1, 2, 3, 4, 5]

# if文を使う
r = []
for i in t:
    if i % 2 == 0:
      r.append(i)
print(r) # [2, 4]
# ワンライナーで書ける
r = [i for i in t if i % 2 == 0]
print(r) # [2, 4]

# 複数のリストを組み合わせる
t = (1, 2, 3, 4, 5)
b = (6, 7, 8, 9, 10)
# 通常のリストの作り方
l = []
for i in t:
    for j in b:
        l.append(i * j)
print(l) # [6, 7, 8, 9, 10, 12, 14, 16, 18, 20, 18, 21, 24, 27, 30, 24, 28, 32, 36, 40, 30, 35, 40, 45, 50]
# ワンライナーで書ける
l = [i * j for i in t for j in b] # 読みづらいからあまり使わない
print(l) # [6, 7, 8, 9, 10, 12, 14, 16, 18, 20, 18, 21, 24, 27, 30, 24, 28, 32, 36, 40, 30, 35, 40, 45, 50]
